farandula-java/target/classes/travelport/XML.request/AirAvailability_Rq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <air:AvailabilitySearchReq xmlns:air="http://www.travelport.com/schema/air_v34_0" AuthorizedBy="user" TargetBranch="P7015254" TraceId="trace">
            <com:BillingPointOfSaleInfo xmlns:com="http://www.travelport.com/schema/common_v34_0" OriginApplication="UAPI"/>
            <air:SearchAirLeg>
                <air:SearchOrigin>
                    <com:Airport xmlns:com="http://www.travelport.com/schema/common_v34_0" Code="SYD"/>
                </air:SearchOrigin>
                <air:SearchDestination>
                    <com:Airport xmlns:com="http://www.travelport.com/schema/common_v34_0" Code="MEL"/>
                </air:SearchDestination>
                <air:SearchDepTime PreferredTime="2017-09-24"/>
            </air:SearchAirLeg>
            <air:AirSearchModifiers>
                <air:PreferredProviders>
                    <com:Provider xmlns:com="http://www.travelport.com/schema/common_v34_0" Code="1G"/>
                </air:PreferredProviders>
            </air:AirSearchModifiers>
        </air:AvailabilitySearchReq>
    </soapenv:Body>
</soapenv:Envelope>
